{"meta":{"title":"XiaoQi's Blog","subtitle":"认真生活","description":"woshuoguniang","author":"XiaoQi","url":"http://yoursite.com","root":"/"},"pages":[{"title":"","date":"2020-04-08T08:10:01.896Z","updated":"2020-04-08T08:10:01.896Z","comments":true,"path":"categories/index.html","permalink":"http://yoursite.com/categories/index.html","excerpt":"","text":"努力开发中……"},{"title":"","date":"2020-04-08T08:07:27.041Z","updated":"2020-04-08T08:07:27.041Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":"hi，你好呀！ 这里是一个没有故事的女同学 自从学了计算机之后诗和远方都与我无关 宅家敲代码成了常态 要努力学习，认真生活 愿你我都能站在热爱的世界里闪闪发光"},{"title":"","date":"2020-04-08T08:13:10.536Z","updated":"2020-04-08T08:13:10.536Z","comments":true,"path":"contact/index.html","permalink":"http://yoursite.com/contact/index.html","excerpt":"","text":"即将上线，敬请期待……"},{"title":"","date":"2020-04-08T07:53:24.783Z","updated":"2020-04-08T07:53:24.783Z","comments":true,"path":"friends/index.html","permalink":"http://yoursite.com/friends/index.html","excerpt":"","text":"网络一线牵，珍惜这段缘，可以互留链接"},{"title":"","date":"2020-04-08T08:10:39.130Z","updated":"2020-04-08T08:10:39.130Z","comments":true,"path":"tags/index.html","permalink":"http://yoursite.com/tags/index.html","excerpt":"","text":"努力开发中……"}],"posts":[{"title":"谷歌搜索","slug":"谷歌搜索","date":"2020-04-06T02:07:05.049Z","updated":"2020-04-06T02:39:21.072Z","comments":true,"path":"2020/04/06/谷歌搜索/","link":"","permalink":"http://yoursite.com/2020/04/06/%E8%B0%B7%E6%AD%8C%E6%90%9C%E7%B4%A2/","excerpt":"第一篇 在搜索框上输入：“indexof/”inurl:lib 再按搜索你将进入许多图书馆，并且一定能下载自己喜欢的书籍。 在搜索框上输入：“indexof/”cnki 再按搜索你就可以找到许多图书馆的CNKI、VIP、超星等入口！","text":"第一篇 在搜索框上输入：“indexof/”inurl:lib 再按搜索你将进入许多图书馆，并且一定能下载自己喜欢的书籍。 在搜索框上输入：“indexof/”cnki 再按搜索你就可以找到许多图书馆的CNKI、VIP、超星等入口！ 在搜索框上输入：“indexof/”ppt 再按搜索你就可以突破网站入口下载powerpint作品！ 在搜索框上输入：“indexof/”mp3 再按搜索你就可以突破网站入口下载mp3、rm等影视作品！ 在搜索框上输入：“indexof/”swf 再按搜索你就可以突破网站入口下载flash作品！ 在搜索框上输入：“indexof/”要下载的软件名 再按搜索你就可以突破网站入口下载软件！ 注意引号应是英文的！ 再透露一下，如果你输入： “indexof/”AVI 另补上第二篇 用GOOgle看世界!!!只要你在GOOGLE里输入特殊的关键字,就可以搜到数千个摄象头的IP地址!通过他你就可以看到其所摄的实时影象!! 在google里输入 inurl:”viewerframe?mode=” 随便打开一个,然后按提示装一个插件,就可以看到了!!! 再补上第三篇 三则黑客的Google搜索技巧简介 大家都知道，Google毫无疑问是当今世界上最强大的搜索引擎。然而，在黑客手中，它也是一个秘密武器，它能搜索到一些你意想不到的信息。赛迪编者把 他们进行了简单的总结不是希望您利用他去攻击别人的网站，而是利用这些技巧去在浩如烟海的网络信息中，来个大海捞针，寻找到对您有用的信息。 如果您是一名普通网民，您可以使用黑客的技巧扩大自己的视野，提高自己的检索效率；如果您是一名网管，请您赶快看看您的网站是否做好了对下面黑客探测手 段的防范措施，如果没有就赶快来个亡羊补牢，毕竟隐患胜于明火，防范胜于救灾；如果您是一名黑客，相信您早以在别的黑客站点上见过类似的方法，这篇文章对 您没什么用处，这里的技巧对您是小儿科，菜鸟级！您可以节省宝贵的时间做更有意义的事情，这篇文章您不用看了，到别处去吧！ 基于上面的考虑我编发了这篇文章。 搜索URL 比如我们提交这种形式：passwd.txtsite:virtualave.net 看到了什么？是不是觉得太不可思议了！有很多基于CGI/PHP/ASP类型的留言板存在这种问题。有时我们得到密码甚至还是明码的！管理员或许太不负 责了，或许安全防范的意识太差了，如果你是网络管理员，赶快检查一下不要让恶意攻击者捡了便宜。不要太相信DES加密，即使我们的密码经过DES加密的密 码，黑客们还是可以通过许多破解软件来搞定。 这次我们能得到包含密码的文件。“site:virtualave.net”意思是只搜索virutalave.net的URL。virutalave.net是一个网络服务器提供商。 同样，我们可以搜索一些顶级域名，比如：.net.org.jp.in.gr config.txtsite:.jp admin.txtsite:.tw 搜索首页的目录 首页是非常有用的，它会提供给你许多有用的信息。 我们提交如下的形式： “Indexof/admin” “Indexof/secret” “Indexof/cgi-bin”site:.edu 你可以自己定义搜索的首页字符。这样就可以获得许多信息。 搜索特定的文件类型 比如你想指定一种文件的类型，可以提交如下形式： filetype:.docsite:.milclassified 这个就是搜索军方的资料，你可以自定义搜索。 再提供一个第四篇 Google的特殊功能 1、查询电话号码 Google的搜索栏中最新加入了电话号码和美国街区地址的查询信息。 个人如想查找这些列表，只要填写姓名，城市和省份。 如果该信息为众人所知，你就会在搜索结果页面的最上方看到搜索的电话和街区地址 你还可以通过以下任何一种方法找到该列表： 名字（或首位大写字母），姓，电话地区号 名字（或首位大写字母），姓，邮递区号 名字（或首位大写字母），姓，城市（可写州） 名字（或首位大写字母），姓，州 电话号码，包括区号 名字，城市，州 名字，邮递区号 2、查找PDF文件 现在GOOGLE的搜索结果中包括了PDF文件。尽管PDF文件不如HTML文件那么多，但他们经常具备一些其他文件不具备的高质量信息 为了显示一个搜索结果是PDF文件而不是网页，PDF文件的标题开头显示蓝色文本。 这就是让你知道ACRTOBATREADER程序会启动来阅读文件 如果你的计算机没装有该程序，计算机会指导你去能免费下载该程序的网页。 使用PDF文件时，相关的网页快照会由“TEXTVERSION”代替，它是PDF文档的复制文件，该文件除去了所有格式化命令。 如果你在没有PDF链接的情况下想看一系列搜索结果，只要在搜索栏中打上-inurldf加上你的搜索条件。 文字限制，主要就发这些我觉得有意思的吧。还有几个比较冷门，就不发了。 Google是一个非常精密成熟的搜索引擎，其搜索结果的丰富性和准确度较其他搜索引擎都要好，但大多数用户都还只是停留在搜索框中输入一两个关键字，然后点击“搜索”按钮的阶段，这一过程是非常低效和无谓的。学习一些搜索引擎常用的搜索语法是一件低投入高回报，受益终身的事情。 搜索运算符 site: 仅从特定网站或网域获得搜索结果 site:chongbuluo.com link: 查找链接到某个特定网页的网页 link:chongbuluo.com related: 查找与该网站相似的网站 related:chongbuluo.com cache: 查看网页在Google上的缓存 cache:chongbuluo.com info: 同时查看某网站以上4种信息 info:chongbuluo.com inurl: 查找在URL地址里有搜索关键词的页面 inurl:chongbuluo intitle: 查找在网页标题里有搜索关键词的页面 intitle:chongbuluo inanchor: 查找特定关键词的锚文本链接 inanchor:chongbuluo intext: 查找你想要搜索的内容出现在网页正文里面 intext:chongbuluo filetype: 查找pdf,xml,xls,txt,doc,csv等特定格式的结果 filetype:pdf chongbuluo define: 快速查询关键词的定义 define:chongbuluo 混合运算符 你可以混合使用搜索运算符，试试 site:chongbuluo.com OR site:baidu.com “apple” -iphone 隐藏彩蛋 do a barrel rool 让你的页面旋转360°, “Z or R twice”也可以 [查看效果](https://www.google.com/search?name=f&amp;hl=en&amp;q=do a barrel roll&amp;hl=en-US&amp;safe=off) askew 会使搜索结果页面倾斜…, “tilt” 也可以 查看效果 zerg rush 在搜索页面上会降下很多圆圈，降落的圆圈会将搜索结果”炸”掉 [查看效果](https://www.google.com/search?name=f&amp;hl=en&amp;q=zerg rush&amp;hl=en-US&amp;safe=off) google pacman 会出现一个”吃豆豆”的游戏, 点击Play可以进行游戏了 [查看效果](https://www.google.com/search?name=f&amp;hl=en&amp;q=Google Pacman&amp;hl=en-US&amp;safe=off) atari breakout 在google images里搜索会出现一个打砖块的游戏 查看效果 google gravity 进行文字和图片搜索，所有东西会从空而降 查看效果 google sphere 进行图片搜索, 图片会围着搜索框旋转 查看效果 高级设置 搜索设置 更加全面地使用 Google 搜索的最好方式是点击“高级搜索”中查找选项。 手气不错 点击”I’m Feeling Lucky” （手气不错）可以直接访问关键词搜索第一个结果的网页。 安全搜索 Google 的安全搜索可以保护你免受成人内容的侵犯，你可以在搜索设置中开启这个功能。 取消区域限制 访问 https://www.google.com/ncr 可以取消区域限制，防止跳转到google.com.hk去。 习惯偏好 在 www.google.com/account 上注册一个帐号便可以保存你的 Google 使用习惯偏好。 广告设置 在 Ads Preferences 中可以设置不显示谷歌广告。 搜索历史 在 Google History 可以查看搜索历史并提供下载。 谷歌帐户安全 在 Permissions 可查看帐户授权情况，Activity 可查看登录情况，Dashboard 可查看活动情况。 下载谷歌数据 在 Google Takeout 中可以下载你的所有谷歌数据。 谷歌帐户删除 在 Google Downgrade 中可以删除你的谷歌帐户。 互联网，最重要的特征便是互联（GFW：怪我咯）。当你偶遇邂逅或者踏破铁鞋找寻到一条非常有用的信息时，记得把冰山的另一部分也“挖”出来。这是构建知识图谱、拓展领域内知识极为有效的方式。比如你搜“CSS”，选择搜索结果中的一篇文章查看，可能看到关键字“响应式布局”，好奇的你会去搜“响应式布局”，又会看到关键字“Bootstrap”，你再去看Bootstrap的文章，又可能看到Bootstrap的各种插件，如此下去，你可以从单纯的“CSS”知识点顺藤摸瓜找到更为前沿和具体的其他技术。再比如，你在某论坛里搜一个问题，然后有某位网友回答得很精彩，你除了拍案称奇之外，也应该点击这位网友的头像进入他的主页，去看看他还有没有其他精彩的言论或者文章，进行深层次的“挖坟行动”。特别是在微博、知乎、豆瓣这类社交应用上，点几下，你就能跳转到更为精彩的世界。 搜索引擎是一项伟大的技术。从某种程度上，搜索引擎的存在，使得知识的获取与传播变得更加容易。搜索引擎像一只手，或者更确切地说，像一个过滤网，帮助我们在巨大的互联网资源中，抓取、过滤出我们需要的信息。 **搜索引擎的使用，有时候，就像我们对一个知识渊博的老师提问。 在提问的过程中，对于解决问题的质量的因素，往往有：老师的水平、提问的方式（内容的组织，对关键信息的把握），前期提问者所做的工作等等。** 在使用搜索引擎的时候，为了提高命中我们需要信息的命中率，与上面提到的因素也类似。 一、选择1~3个搜索引擎 一个强大的搜索引擎足以解决绝大多数问题。但有时候，多一个搜索引擎也许能带来惊喜，但也不宜过多。搜索的惊喜，往往它能带你看到你之前完全看不到的东西。 搜索引擎的水平，很大程度上，决定着我们搜索的结果。即便选择多个搜索引擎，也需要按照它们各自的水平，给它们设定一定的优先级。 对了，还有一点，使用谷歌的时候，有时会根据你的地址，会有hk等后缀，建议使用Google本尊，google.com/ncr。NCR: No Country Redirection，没有国家地区指向性。 二、提问的方式**2.1 对关键信息的提炼关键，往往，建立在基本事物上，但存在与其他事物不同的地方，能使得它与基本事物进行很容易的区分。** 我们在知乎，或者在论坛社区中提问，都潜在地表明了关键。我们对问题的阐述，就是关键信息的表达。在某些技术性问题中，回答者往往会让提问者说明自己问题的来源，甚至自己对问题的尝试过程。问题的来源，使得问题的关键信息更多，这个问题的阐述也就更加完整，回答者才能更好地回答。 关键信息的提炼，更多地源于自己的思考和实践。 2.2 善用关键词组合，而不是疑问句 经常能看到这样的搜索，“如何…”，“怎么…”。搜索引擎设计之初，更喜欢解决的是关键词之间的组合。如今，即便我们搜索疑问句，也能够在大多数情况下，搜索到比较满意的答案。一部分是因为搜索引擎技术的提升，我觉得更重要的原因是，论坛社区长时间积累的庞大信息，以及我们问题的常见性。 善用关键词组合，不仅能够锻炼自己的搜索能力，还往往能够发现新的天地，。对了，在搜索中，有个~（波浪号）搜索运算符，是搜索与关键词相关的内容，往往比较有意思。**对于不常见的问题，或者新的领域，关键词组合带来的信息是疑问句不可比拟的。****2.3 高级的表达方式** 如果你搜索： 搜索 技巧。往往会出现一大堆讲搜索运算符的，搜索关键字的。这的确很有用，但是往往你看了那么多，最后搜索的时候，也忘记，忘记后，你也懒得去重新找那些搜索运算符。其实，更好的解决办法是，学会使用搜索引擎设有的高级搜索。相当于那些搜索运算符的可视化界面。 你看，右边提示了那些搜索运算符。当搜索结果不理想的时候，尝试使用它。包括那些搜索关键词能实现的，高级搜索也可以做到大部分。什么搜文件类型，都不在话下。 2.4 换种语言，尝试用英语不得不承认，在信息的数量上面，英文的信息量更多。 说了这么多，我们来尝试搜索个问题。以谷歌、百度、必应来进行测试。 问题： Google 在2008年1月推出了庆祝新年的特别版涂鸦 Logo，而它同时也是为了庆祝___。 （摘自：虫部落邀请码第12期题目） 第一步，我们需要提取关键字。 关键字的提取，大致上是差不多的，在细节上，会因人而异。 我们尝试保留大多数信息，同时留下特殊的关键词。 Google 2008年1月 新年 特别版涂鸦 Logo 在搜索时，第一个技巧是用 空格 把关键词隔开。 从左到右分别是：谷歌、百度、必应 我用红色方框将直接能命中答案的结果给标注出来。虽然都可以获得答案，但是结果不是很理想。 第二步，利用高级搜索使搜索结果更加精确三个搜索引擎的结果差不多。“新年”、”2008年1月“，这些关键词是我们要查找事物的特殊属性。我们希望能够保留这些关键信息。 我们分别打开三个搜索引擎的高级搜索，利用高级搜索来代替我们在技巧中常见的搜索运算符。 搜索引擎的排序在搜索中，也是一个很重要的因素。我们在之后的搜索中，取前三个搜索结果，并对其中的内容进深一步进行考察。 我们对新年这个关键词，对它给予保留，使得我们对答案的命中率更高。 我们可以不去记那些众多的搜索运算符，善用高级搜索，就可以帮助我们更好地解决一些问题。等用的多了，那些搜索运算符就烂熟于心了。 当然，我们也可以去搜索图片，2008年1月 Google的那个logo，也可以更好地找到答案。 还有个小技巧，当我们点开链接后，善用页面查找，Ctrl + F能够更快定位到需要的地方。","categories":[],"tags":[]},{"title":"GitHub搜索","slug":"GitHub搜索","date":"2020-04-06T02:06:54.019Z","updated":"2020-04-06T02:38:48.784Z","comments":true,"path":"2020/04/06/GitHub搜索/","link":"","permalink":"http://yoursite.com/2020/04/06/GitHub%E6%90%9C%E7%B4%A2/","excerpt":"寻找 Demo技术栈的关键字搜索，并按更新时间进行排序生命有限 ，如若是每次我们尝试一个新的技术，总得自己编写一个个 Demo。编写多个 Demo，都得花去个半天八小时的时间。如此一算，能花费在其它事情上的时间便更少了。若只是试用官方的 Demo，往往是比较容易的。可我们编写应用的时候，总得结合到当前的场合来。这时整合并不是一个轻松的工作，依赖冲突、引入第三方依赖等。 温馨提醒：对于简单的项目来说，自己直接写 Demo 会更加方便。尝试项目需要成本，若是需要尝试使用多个项目，那么有可能就浪费时间。","text":"寻找 Demo技术栈的关键字搜索，并按更新时间进行排序生命有限 ，如若是每次我们尝试一个新的技术，总得自己编写一个个 Demo。编写多个 Demo，都得花去个半天八小时的时间。如此一算，能花费在其它事情上的时间便更少了。若只是试用官方的 Demo，往往是比较容易的。可我们编写应用的时候，总得结合到当前的场合来。这时整合并不是一个轻松的工作，依赖冲突、引入第三方依赖等。 温馨提醒：对于简单的项目来说，自己直接写 Demo 会更加方便。尝试项目需要成本，若是需要尝试使用多个项目，那么有可能就浪费时间。 寻找 架构技术栈 + boilerplate 又或者是 starter 等关键词进行搜索无论是后端的微服务架构，还是前端应用，应用的架构正在变得复杂。后端微服务，需要结合一个个的框架，哪怕是 Spring Initializr 这样的工具，也只能帮助我们搭建项目。我们还需要配合其它工具，一起搭建出一个基本的系统。对于前端应用也是类似的，若是 Angular 这样大而全的框架，时间花费倒也是不多。如 React 这种需要组合的、小而美的框架，使用官方的 create-react-app 也很难做出我们想要的东西，寻找一个合适的脚手架是一个更好的选择。 这时，我们大抵可以，直接使用技术栈 + boilerplate 又或者是 starter 等关键词进行搜索，如 react boilerplate。如果其中找到的组合技术栈，不符合自己的要求，那么再加上相应技术栈的关键字，如 react redux boilerplate 即可。有意思的是，在这时使用 Google 会比 GitHub 方便一些。 温馨提醒：我们需要衡量：修改脚手架的成本，是否比自己重头写快。 寻找 awesome-xxx 系列Awesome + 领域、语言、框架等当你想了解一个框架，造个轮子，不妨试试搜索 xxx-like 或者 xxx-like framework，中文便是 仿 react 框架 或者 类 react。如我们在 Google 上搜索 react-like 就会搜索到 inferno。不过，按 GitHub 的尿性，要搜索到这样的框架，并不是一件容易的事。这时 Google 往往比 GitHub 搜索好用。 寻找 数据与爬虫工具scrapy + 网站名称或域名当我们需要数据的时候，就会考虑写爬虫。于是 GitHub 上充满了各各样的式爬虫，除此还有得同学把爬虫数据都放在上面了。某次，当我在玩 ElasticSearch 搜索引擎的时候，突然需要一些真实的数据用来测试。便得找爬虫，就在 GitHub 上，找到了大众点评的一些爬虫。 这个关键词，就是： scrapy dianping.com，得来不费功夫。 寻找 干货资源知识点 + 笔记；书名GitHub 上拥有大量的学习资源，从各类的文章到笔记，还有各式各样的电子书。如： 只需要搜索： 类型 + 笔记，如 操作系统 笔记 就能找到一些操作系统相关的笔记。只需要搜索： 书名 就能找到一些和这本书相关的资源，如 重构 改善既有代码的设计。 寻找 模仿轮子的轮子框架 + like当你想了解一个框架，造个轮子，不妨试试搜索 xxx-like 或者 xxx-like framework，中文便是 仿 react 框架 或者 类 react。如我们在 Google 上搜索 react-like 就会搜索到 inferno。不过，按 GitHub 的尿性，要搜索到这样的框架，并不是一件容易的事。这时 Google 往往比 GitHub 搜索好用。","categories":[],"tags":[]}],"categories":[],"tags":[]}